cf/DataProcessors/ФормированиеПлатежныхПорученийНаУплатуНалогов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>ФормированиеПлатежныхПорученийНаУплатуНалогов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОстатков</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>БухОстатки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Оплатить</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НалоговыеДекларации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Оплатить</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ссылка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РегламентированныйОтчет</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеОтчета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодОтчета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПодписи</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПлатежныеПоручения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ссылка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПлатежноеПоручение</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНалога</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодБК</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодОКАТО</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>11</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусСоставителя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>2</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказательПериода</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИННПлательщика</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>12</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПППлательщика</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДокумента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НазначениеПлатежа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетКонтрагента</Name>
							<Comment>(Общ) Банковский счет контрагента</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИННПолучателя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>12</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПППолучателя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>11</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

cf/AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccountingRegister>
		<Properties>
			<Name>Хозрасчетный</Name>
			<Comment>(Регл)</Comment>
			<ChartOfAccounts>ChartOfAccounts.Хозрасчетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.УчетПоПодразделениям</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеКорректироватьСтоимостьАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

cf/Enums/ЮрФизЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ЮрФизЛицо</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮрЛицо</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизЛицо</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Enums/ВидыПлатежейВГосБюджет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыПлатежейВГосБюджет</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Налог</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогСам</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогАкт</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПениСам</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПениАкт</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Штраф</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходыПоСтрахованию</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученоИзФонда</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПринято</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/DataProcessors/ФормированиеПлатежныхПорученийНаУплатуНалогов/Ext/ObjectModule.bsl
Перем мВалютаРегламентированногоУчета Экспорт;

// {ОбособленныеПодразделения
Перем мРегистрацияВИФНС;
// }ОбособленныеПодразделения 

# Если Клиент Тогда

// Заполнение таблицы бух.остатков на конец указанной даты
//
Функция ЗаполнитьОстаткиНаСчетах68и69(КонДата) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ХозрасчетныйОстатки.Счет КАК СчетУчета,
	|	ЕСТЬNULL(ХозрасчетныйОстатки.Подразделение, ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)) КАК Поле1,
	|	ХозрасчетныйОстатки.Субконто1,
	|	ХозрасчетныйОстатки.Субконто2,
	|	ХозрасчетныйОстатки.Субконто3,
	|	-ХозрасчетныйОстатки.СуммаОстаток КАК Сумма
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(
	|			&ГраницаОстатков,
	|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоНалогам))
	|				ИЛИ Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоСоциальномуСтрахованию)),
	|			,
	|			Организация = &Организация) КАК ХозрасчетныйОстатки
	|ГДЕ
	|	ХозрасчетныйОстатки.СуммаОстаток < 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	СчетУчета,
	|	Поле1
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("ГраницаОстатков", Новый Граница(КонецДня(КонДата), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация", Организация);
	ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаРезультата;

КонецФункции

Функция СоздатьПустуюТаблицуДанных()

	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("СуммаДокумента",      ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15, 2));
	ТаблицаДанных.Колонки.Добавить("КодБК",               ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(20));
	ТаблицаДанных.Колонки.Добавить("КодОКАТО",            ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(11));
	ТаблицаДанных.Колонки.Добавить("ОчередностьПлатежа",  ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(1, 0));
	ТаблицаДанных.Колонки.Добавить("СтатусСоставителя",   ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(2));
	ТаблицаДанных.Колонки.Добавить("ИННПлательщика",      ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(12));
	ТаблицаДанных.Колонки.Добавить("КПППлательщика",      ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(9));
	ТаблицаДанных.Колонки.Добавить("ПоказательОснования", ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(2));
	ТаблицаДанных.Колонки.Добавить("ПоказательТипа",      ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(2));
	ТаблицаДанных.Колонки.Добавить("ПоказательПериода",   ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(10));
	ТаблицаДанных.Колонки.Добавить("НазначениеПлатежа",   ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(250));
	ТаблицаДанных.Колонки.Добавить("Контрагент",          Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТаблицаДанных.Колонки.Добавить("СчетКонтрагента",     Новый ОписаниеТипов("СправочникСсылка.БанковскиеСчета"));
	ТаблицаДанных.Колонки.Добавить("ВидПлатежа",          ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(15));
	
	Возврат ТаблицаДанных;

КонецФункции 

// {ОбособленныеПодразделения

Функция ПолучитьТаблицуРеквизитовПлатежаПоРегистрацииВИФНС(ИмяРеквизита, ЗначениеРеквизита, КодВидаПлатежа = "")

	Запрос = Новый Запрос;
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ 
	|	1 КАК Приоритет,
	|	СписокРеквизитов.ВидПлатежа,
	|	СписокРеквизитов.ВидПлатежа.КодБК КАК КодБК,
	|	СписокРеквизитов.ВидПлатежа.СчетУчета КАК СчетУчета,
	|	СписокРеквизитов.Получатель КАК Контрагент,
	|	СписокРеквизитов.СчетПолучателя КАК СчетКонтрагента,
	|	СписокРеквизитов.СтатусСоставителя,
	|	СписокРеквизитов.ПоказательОснования,
	|	СписокРеквизитов.ПоказательТипа,
	|	СписокРеквизитов.ОчередностьПлатежа,
	|	СписокРеквизитов.ПоказательПериода,
	|	СписокРеквизитов.НазначениеПлатежа
	|ИЗ
	|	РегистрСведений.РеквизитыУплатыНалоговИПлатежейВБюджет КАК СписокРеквизитов
	|ГДЕ
	|	СписокРеквизитов.ВидПлатежа.СчетУчета = &ЗначениеРеквизита
	|	И СписокРеквизитов.Организация = &Организация
	|	И СписокРеквизитов.РегистрацияВИФНС = &РегистрацияВИФНС";
	Если ЗначениеЗаполнено(КодВидаПлатежа) Тогда
	    ТекстЗапроса = ТекстЗапроса + "
		|	И ПОДСТРОКА(СписокРеквизитов.ВидПлатежа.КодБК, 14, 1) = &КодВидаПлатежа";
	КонецЕсли;
	ТекстЗапроса = ТекстЗапроса + "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ 
	|	2 КАК Приоритет,
	|	СписокРеквизитов.ВидПлатежа,
	|	СписокРеквизитов.ВидПлатежа.КодБК,
	|	СписокРеквизитов.ВидПлатежа.СчетУчета,
	|	СписокРеквизитов.Получатель,
	|	СписокРеквизитов.СчетПолучателя,
	|	СписокРеквизитов.СтатусСоставителя,
	|	СписокРеквизитов.ПоказательОснования,
	|	СписокРеквизитов.ПоказательТипа,
	|	СписокРеквизитов.ОчередностьПлатежа,
	|	СписокРеквизитов.ПоказательПериода,
	|	СписокРеквизитов.НазначениеПлатежа
	|ИЗ
	|	РегистрСведений.РеквизитыУплатыНалоговИПлатежейВБюджет КАК СписокРеквизитов
	|ГДЕ
	|	СписокРеквизитов.ВидПлатежа.СчетУчета = &ЗначениеРеквизита
	|	И СписокРеквизитов.Организация = &Организация
	|	И СписокРеквизитов.РегистрацияВИФНС = ЗНАЧЕНИЕ(Справочник.РегистрацияВИФНС.ПустаяСсылка)";
	Если ЗначениеЗаполнено(КодВидаПлатежа) Тогда
	    ТекстЗапроса = ТекстЗапроса + "
		|	И ПОДСТРОКА(СписокРеквизитов.ВидПлатежа.КодБК, 14, 1) = &КодВидаПлатежа";
	КонецЕсли;
	ТекстЗапроса = ТекстЗапроса + "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ 
	|	3 КАК Приоритет,
	|	СписокРеквизитов.ВидПлатежа,
	|	СписокРеквизитов.ВидПлатежа.КодБК,
	|	СписокРеквизитов.ВидПлатежа.СчетУчета,
	|	СписокРеквизитов.Получатель,
	|	СписокРеквизитов.СчетПолучателя,
	|	СписокРеквизитов.СтатусСоставителя,
	|	СписокРеквизитов.ПоказательОснования,
	|	СписокРеквизитов.ПоказательТипа,
	|	СписокРеквизитов.ОчередностьПлатежа,
	|	СписокРеквизитов.ПоказательПериода,
	|	СписокРеквизитов.НазначениеПлатежа
	|ИЗ
	|	РегистрСведений.РеквизитыУплатыНалоговИПлатежейВБюджет КАК СписокРеквизитов
	|ГДЕ
	|	СписокРеквизитов.ВидПлатежа.СчетУчета = &ЗначениеРеквизита
	|	И СписокРеквизитов.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|	И СписокРеквизитов.РегистрацияВИФНС = ЗНАЧЕНИЕ(Справочник.РегистрацияВИФНС.ПустаяСсылка)";
	Если ЗначениеЗаполнено(КодВидаПлатежа) Тогда
	    ТекстЗапроса = ТекстЗапроса + "
		|	И ПОДСТРОКА(СписокРеквизитов.ВидПлатежа.КодБК, 14, 1) = &КодВидаПлатежа";
	КонецЕсли;
	ТекстЗапроса = ТекстЗапроса + "
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет ВОЗР";
	
	Запрос.Текст = СтрЗаменить(ТекстЗапроса, 
		"ВидПлатежа.СчетУчета = &ЗначениеРеквизита", 
		"ВидПлатежа" + ?(ИмяРеквизита = "Ссылка", "", "." + ИмяРеквизита) + " = &ЗначениеРеквизита"); 
	Запрос.УстановитьПараметр("ЗначениеРеквизита", ЗначениеРеквизита);
	Если ЗначениеЗаполнено(КодВидаПлатежа) Тогда
		Запрос.УстановитьПараметр("КодВидаПлатежа", КодВидаПлатежа);
	КонецЕсли;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("РегистрацияВИФНС", мРегистрацияВИФНС);
	
	ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаРезультата;

КонецФункции // ПолучитьТаблицуРеквизитовПлатежаПоРегистрацииВИФНС()

// }ОбособленныеПодразделения 

Функция ПолучитьТаблицуРеквизитовПлатежаПоОрганизации(ИмяРеквизита, ЗначениеРеквизита, КодВидаПлатежа = "") 
	
	Запрос = Новый Запрос;
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ 
	|	1 КАК Приоритет,
	|	СписокРеквизитов.ВидПлатежа,
	|	СписокРеквизитов.ВидПлатежа.КодБК КАК КодБК,
	|	СписокРеквизитов.ВидПлатежа.СчетУчета КАК СчетУчета,
	|	СписокРеквизитов.Получатель КАК Контрагент,
	|	СписокРеквизитов.СчетПолучателя КАК СчетКонтрагента,
	|	СписокРеквизитов.СтатусСоставителя,
	|	СписокРеквизитов.ПоказательОснования,
	|	СписокРеквизитов.ПоказательТипа,
	|	СписокРеквизитов.ОчередностьПлатежа,
	|	СписокРеквизитов.ПоказательПериода,
	|	СписокРеквизитов.НазначениеПлатежа
	|ИЗ
	|	РегистрСведений.РеквизитыУплатыНалоговИПлатежейВБюджет КАК СписокРеквизитов
	|ГДЕ
	|	СписокРеквизитов.ВидПлатежа.СчетУчета = &ЗначениеРеквизита
	|	И СписокРеквизитов.Организация = &Организация";
	Если ЗначениеЗаполнено(КодВидаПлатежа) Тогда
	    ТекстЗапроса = ТекстЗапроса + "
		|	И ПОДСТРОКА(СписокРеквизитов.ВидПлатежа.КодБК, 14, 1) = &КодВидаПлатежа";
	КонецЕсли;
	ТекстЗапроса = ТекстЗапроса + "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ 
	|	2 КАК Приоритет,
	|	СписокРеквизитов.ВидПлатежа,
	|	СписокРеквизитов.ВидПлатежа.КодБК,
	|	СписокРеквизитов.ВидПлатежа.СчетУчета,
	|	СписокРеквизитов.Получатель,
	|	СписокРеквизитов.СчетПолучателя,
	|	СписокРеквизитов.СтатусСоставителя,
	|	СписокРеквизитов.ПоказательОснования,
	|	СписокРеквизитов.ПоказательТипа,
	|	СписокРеквизитов.ОчередностьПлатежа,
	|	СписокРеквизитов.ПоказательПериода,
	|	СписокРеквизитов.НазначениеПлатежа
	|ИЗ
	|	РегистрСведений.РеквизитыУплатыНалоговИПлатежейВБюджет КАК СписокРеквизитов
	|ГДЕ
	|	СписокРеквизитов.ВидПлатежа.СчетУчета = &ЗначениеРеквизита
	|	И СписокРеквизитов.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)";
	Если ЗначениеЗаполнено(КодВидаПлатежа) Тогда
	    ТекстЗапроса = ТекстЗапроса + "
		|	И ПОДСТРОКА(СписокРеквизитов.ВидПлатежа.КодБК, 14, 1) = &КодВидаПлатежа";
	КонецЕсли;
	ТекстЗапроса = ТекстЗапроса + "
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет ВОЗР";
	
	Запрос.Текст = СтрЗаменить(ТекстЗапроса, 
		"ВидПлатежа.СчетУчета = &ЗначениеРеквизита", 
		"ВидПлатежа" + ?(ИмяРеквизита = "Ссылка", "", "." + ИмяРеквизита) + " = &ЗначениеРеквизита"); 
	Запрос.УстановитьПараметр("ЗначениеРеквизита", ЗначениеРеквизита);
	Если ЗначениеЗаполнено(КодВидаПлатежа) Тогда
		Запрос.УстановитьПараметр("КодВидаПлатежа", КодВидаПлатежа);
	КонецЕсли;	
	Запрос.УстановитьПараметр("Организация", Организация);
	
	ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаРезультата;

КонецФункции // ПолучитьТаблицуРеквизитовПлатежаПоОрганизации()

Функция ПолучитьТаблицуРеквизитовПлатежа(ИмяРеквизита, ЗначениеРеквизита, КодВидаПлатежа = "")
	
	// {ОбособленныеПодразделения
	Если мРегистрацияВИФНС <> Неопределено Тогда
		ТаблицаРезультата = ПолучитьТаблицуРеквизитовПлатежаПоРегистрацииВИФНС(ИмяРеквизита, ЗначениеРеквизита, КодВидаПлатежа);
		Возврат ТаблицаРезультата;
	КонецЕсли;
	// }ОбособленныеПодразделения 
	
	ТаблицаРезультата = ПолучитьТаблицуРеквизитовПлатежаПоОрганизации(ИмяРеквизита, ЗначениеРеквизита, КодВидаПлатежа);
	Возврат ТаблицаРезультата;

КонецФункции // ПолучитьТаблицуРеквизитовПлатежа()

Функция ПодготовитьТаблицуДанныхПоОстатку(СтрокаОстатка)

	ТаблицаДанных = СоздатьПустуюТаблицуДанных();
	
	СтрокаДанных = ТаблицаДанных.Добавить();
	СтрокаДанных.СуммаДокумента = СтрокаОстатка.Сумма;
	
	СтрокаДанных.КодОКАТО       = Организация.КодПоОКАТО;
	
	ЭтоФизЛицо = (Организация.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо );
	СтрокаДанных.КПППлательщика = ?(ЭтоФизЛицо, "0", Организация.КПП);
	
	// {ОбособленныеПодразделения
	Если ТипЗнч(СтрокаОстатка.Субконто1) = Тип("СправочникСсылка.РегистрацияВИФНС") Тогда
		мРегистрацияВИФНС = СтрокаОстатка.Субконто1;
	ИначеЕсли ТипЗнч(СтрокаОстатка.Субконто2) = Тип("СправочникСсылка.РегистрацияВИФНС") Тогда
		мРегистрацияВИФНС = СтрокаОстатка.Субконто2;
	ИначеЕсли ТипЗнч(СтрокаОстатка.Субконто3) = Тип("СправочникСсылка.РегистрацияВИФНС") Тогда
		мРегистрацияВИФНС = СтрокаОстатка.Субконто3;
	Иначе
		мРегистрацияВИФНС = Организация.РегистрацияВИФНС;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(мРегистрацияВИФНС) Тогда
		СтрокаДанных.КодОКАТО       = мРегистрацияВИФНС.КодПоОКАТО;
		СтрокаДанных.КПППлательщика = ?(ЭтоФизЛицо, "0", мРегистрацияВИФНС.КПП);
	КонецЕсли;
	// }ОбособленныеПодразделения
	
	КодВидаПлатежа = "";
	Если ТипЗнч(СтрокаОстатка.Субконто1) = Тип("ПеречислениеСсылка.ВидыПлатежейВГосБюджет") Тогда
		Если СтрокаОстатка.Субконто1 = Перечисления.ВидыПлатежейВГосБюджет.НалогСам Тогда
			КодВидаПлатежа = "1";
		ИначеЕсли СтрокаОстатка.Субконто1 = Перечисления.ВидыПлатежейВГосБюджет.НалогАкт Тогда
			КодВидаПлатежа = "1";
		ИначеЕсли СтрокаОстатка.Субконто1 = Перечисления.ВидыПлатежейВГосБюджет.Налог Тогда
			КодВидаПлатежа = "1";
		ИначеЕсли СтрокаОстатка.Субконто1 = Перечисления.ВидыПлатежейВГосБюджет.ПениАкт Тогда
			КодВидаПлатежа = "2";
		ИначеЕсли СтрокаОстатка.Субконто1 = Перечисления.ВидыПлатежейВГосБюджет.ПениСам Тогда
			КодВидаПлатежа = "2";
		ИначеЕсли СтрокаОстатка.Субконто1 = Перечисления.ВидыПлатежейВГосБюджет.Штраф Тогда
			КодВидаПлатежа = "3";
		КонецЕсли;
	КонецЕсли;
	
	ТаблицаРеквизитовПлатежа = ПолучитьТаблицуРеквизитовПлатежа("СчетУчета", СтрокаОстатка.СчетУчета, КодВидаПлатежа);
	
	Если ТаблицаРеквизитовПлатежа.Количество() > 0 Тогда
		СтрокаРеквизитов = ТаблицаРеквизитовПлатежа[0];
		ЗаполнитьЗначенияСвойств(СтрокаДанных, СтрокаРеквизитов);
		ПериодичностьУплаты = СтрокаРеквизитов.ПоказательПериода;
		НазначениеПлатежа = СтрокаРеквизитов.НазначениеПлатежа;
	Иначе
		ПериодичностьУплаты = "МС";
		НазначениеПлатежа = "Уплата налога";
	КонецЕсли;
	
	ДатаНачисленияНалога = НачалоМесяца(ДатаОстатков) - 1;
	
	Если ПериодичностьУплаты = "КВ" Тогда
		ДатаОкончания = КонецКвартала(ДатаНачисленияНалога);
		ДатаНачала    = НачалоКвартала(ДатаОкончания);
		СтрокаДанных.ПоказательПериода = "КВ." + Формат(ДатаОкончания, "ДФ=кк") + "." + Формат(ДатаОкончания, "ДФ=гггг");
		СтрокаДанных.НазначениеПлатежа = НазначениеПлатежа 
			+ " за " + ПредставлениеПериода(ДатаНачала, ДатаОкончания, "ФП = Истина");
	ИначеЕсли ПериодичностьУплаты = "МС" Тогда
		ДатаОкончания = КонецМесяца(ДатаНачисленияНалога);
		ДатаНачала    = НачалоМесяца(ДатаОкончания);
		СтрокаДанных.ПоказательПериода = "МС." + Формат(ДатаОкончания, "ДФ=ММ") + "." + Формат(ДатаОкончания, "ДФ=гггг");
		СтрокаДанных.НазначениеПлатежа = НазначениеПлатежа 
			+ " за " + ПредставлениеПериода(ДатаНачала, ДатаОкончания, "ФП = Истина");
	ИначеЕсли ПериодичностьУплаты = "ПЛ" Тогда
		ДатаОкончания = КонецГода(ДатаНачисленияНалога);
		ДатаНачала    = НачалоГода(ДатаОкончания);
		Если Месяц(ДатаНачисленияНалога) <= 6 Тогда
			СтрокаДанных.ПоказательПериода = "ПЛ.01." + Формат(ДатаОкончания, "ДФ=гггг");
			СтрокаДанных.НазначениеПлатежа = НазначениеПлатежа 
				+ " за 1 полугодие " + ПредставлениеПериода(ДатаНачала, ДатаОкончания, "ФП = Истина");
		Иначе
			СтрокаДанных.ПоказательПериода = "ПЛ.02." + Формат(ДатаОкончания, "ДФ=гггг");
			СтрокаДанных.НазначениеПлатежа = НазначениеПлатежа 
				+ " за 2 полугодие " + ПредставлениеПериода(ДатаНачала, ДатаОкончания, "ФП = Истина");
		КонецЕсли;
	ИначеЕсли ПериодичностьУплаты = "ГД" Тогда
		ДатаОкончания = КонецГода(ДатаНачисленияНалога);
		ДатаНачала    = НачалоГода(ДатаОкончания);
		СтрокаДанных.ПоказательПериода = "ГД.00." + Формат(ДатаОкончания, "ДФ=гггг");
		СтрокаДанных.НазначениеПлатежа = НазначениеПлатежа 
			+ " за " + ПредставлениеПериода(ДатаНачала, ДатаОкончания, "ФП = Истина");
	Иначе
		СтрокаДанных.ПоказательПериода = "0";
		СтрокаДанных.НазначениеПлатежа = НазначениеПлатежа;
	КонецЕсли;
	
	// Заполняем вид платежа так, как он заполнился бы при ручном вводе платежных поручений
	ВидПлатежаПоУмолчанию = ВосстановитьЗначение("ПлатежноеПоручениеВидПлатежа");
	ВидПлатежаБылСохранен = ВидПлатежаПоУмолчанию = ""
		ИЛИ (ТипЗнч(ВидПлатежаПоУмолчанию) = Тип("Строка") 
			И (Найти("Почтой;Телеграфом;Электронно;Срочно;", ВидПлатежаПоУмолчанию) > 0));
	Если НЕ ВидПлатежаБылСохранен Тогда
		ВидПлатежаПоУмолчанию = "Электронно";
	Иначе
		Если ВидПлатежаПоУмолчанию = "" Тогда 
			ВидПлатежаПоУмолчанию = "Электронно";
		КонецЕсли;
	КонецЕсли;
	
	ТаблицаДанных.ЗаполнитьЗначения(ВидПлатежаПоУмолчанию, "ВидПлатежа");
	
	Возврат ТаблицаДанных;

КонецФункции 

Процедура СформироватьПлатежныеПорученияПоОстаткам() Экспорт

	ПлатежныеПоручения.Очистить();
		
	Для каждого СтрокаОстатка Из БухОстатки Цикл
	
		Если НЕ СтрокаОстатка.Оплатить Тогда
			Продолжить;
		КонецЕсли;
		
		ТаблицаДанных = ПодготовитьТаблицуДанныхПоОстатку(СтрокаОстатка);
	
		Для каждого СтрокаДанных Из ТаблицаДанных Цикл
		
			НовыйДокумент = СоздатьПлатежноеПоручение(СтрокаДанных, Неопределено);
			
			Если ЗначениеЗаполнено(НовыйДокумент) Тогда
			
				НоваяСтрока = ПлатежныеПоручения.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, НовыйДокумент);
			
			КонецЕсли;
		
		КонецЦикла; 
		
	КонецЦикла;

КонецПроцедуры

Функция СоздатьПлатежноеПоручение(СтрокаДанных, РегламентированныйОтчет = Неопределено)

	ДокументОбъект = Документы.ПлатежноеПоручение.СоздатьДокумент();
	
	ДокументОбъект.Организация     = Организация;
	ДокументОбъект.СчетОрганизации = СчетОрганизации;
	ДокументОбъект.ПеречислениеВБюджет    = Истина;
	ДокументОбъект.ВидПеречисленияВБюджет = Перечисления.ВидыПеречисленийВБюджет.НалоговыйПлатеж;
		
	ПоРеглОтчету = (ТипЗнч(РегламентированныйОтчет) = Тип("ДокументСсылка.РегламентированныйОтчет"));
	
	Если ПоРеглОтчету Тогда
		ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ДокументОбъект, РегламентированныйОтчет);
	Иначе
		ДокументОбъект.Дата = ОбщегоНазначения.ПолучитьРабочуюДату();
		ТекПользователь = ОбщегоНазначения.ПолучитьЗначениеПеременной("глТекущийПользователь");
		ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ДокументОбъект, ТекПользователь, мВалютаРегламентированногоУчета);
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ДокументОбъект, СтрокаДанных);
	
	АвтоЗначенияРеквизитов = ФормированиеПечатныхФорм.СформироватьАвтоЗначенияРеквизитовПлательщикаПолучателя(
		ДокументОбъект.Организация, ДокументОбъект.СчетОрганизации, 
		ДокументОбъект.Контрагент, ДокументОбъект.СчетКонтрагента, Истина);
	
	ДокументОбъект.ТекстПлательщика = АвтоЗначенияРеквизитов.ТекстПлательщика;
	ДокументОбъект.ИННПлательщика   = АвтоЗначенияРеквизитов.ИННПлательщика;
	// КПП плательщика из значений по умолчанию не заполняем - он может отличаться
	
	ДокументОбъект.ТекстПолучателя = АвтоЗначенияРеквизитов.ТекстПолучателя;
	ДокументОбъект.ИННПолучателя   = АвтоЗначенияРеквизитов.ИННПолучателя;
	ДокументОбъект.КПППолучателя   = АвтоЗначенияРеквизитов.КПППолучателя;
	
	ДокументОбъект.ПоказательНомера = "0";
	ДокументОбъект.ПоказательДаты   = ?(ПоРеглОтчету, РегламентированныйОтчет.ДатаПодписи, "0");
	
	Если НЕ ЗначениеЗаполнено(ДокументОбъект.ОчередностьПлатежа) Тогда
		ДокументОбъект.ОчередностьПлатежа = "4";
	КонецЕсли;
		
	Попытка
	
		ДокументОбъект.Записать();
		Возврат ДокументОбъект.Ссылка;
	
	Исключение
		
		ОбщегоНазначения.СообщитьОбОшибке("Не сформировано платежное поручение на " 
			+ СтрокаДанных.СуммаДокумента + " руб." + Символы.ПС + Символы.Таб + СтрокаДанных.НазначениеПлатежа);
		ОбщегоНазначения.СообщитьОбОшибке(ОписаниеОшибки());
		
		Возврат Документы.ПлатежноеПоручение.ПустаяСсылка();
	
	КонецПопытки;

КонецФункции

# КонецЕсли

мВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
